<?php

use Illuminate\Database\Seeder;

class ProductCategoriesTableSeeder extends Seeder
{
    public function run()
    {
        $seeds = [
            ['デジタルミュージック', 1],
            ['Android アプリ', 2],
            ['本', 3],
            ['洋書', 4],
            ['ミュージック', 5],
            ['クラシック', 6],
            ['DVD', 7],
            ['TVゲーム', 8],
            ['PCソフト', 9],
            ['パソコン・周辺機器', 10],
            ['家電&カメラ', 11],
            ['文房具・オフィス用品', 12],
            ['ホーム&キッチン', 13],
            ['ペット用品', 14],
            ['ドラッグストア', 15],
            ['ビューティー', 16],
            ['ラグジュアリービューティー', 17],
            ['食品・飲料・お酒', 18],
            ['ベビー&マタニティ', 19],
            ['ファッション', 20],
            ['服＆ファッション小物', 21],
            ['シューズ＆バッグ', 22],
            ['腕時計', 23],
            ['ジュエリー', 24],
            ['おもちゃ', 25],
            ['ホビー', 26],
            ['楽器', 27],
            ['スポーツ&アウトドア', 28],
            ['車＆バイク', 29],
            ['DIY・工具・ガーデン', 30],
            ['大型家電', 31],
            ['クレジットカード', 32],
            ['ギフト券', 33],
            ['産業・研究開発用品', 34],
        ];
        foreach ($seeds as $seed) {
            DB::table('product_categories')->insert([
                'name' => $seed[0],
                'order_no' => $seed[1],
                'created_at' => new Datetime(),
            ]);
        }
    }
}
